# Introduction to Pandas

ðŸ¤– `Notebook by` [Ihsanul Haque](https://www.linkedin.com/in/ihsanul09/)

âœ… `Machine Learning Source Codes` [GitHub](https://https://github.com/ihsanulcode/ML-Batch-2)

ðŸ“Œ `Machine Learning from Scratch` [Course Outline](https://https://docs.google.com/document/d/15mGNTUSlWQsy4TzcLZUdYedpCMO5KiVq1USaDprHaIc/edit?usp=sharing)

# What is Pandas?

Pandas is a popular open-source Python library used for data manipulation and analysis. It provides powerful data structures and tools for working with structured data, primarily in the form of data frames (tables) that allow you to perform operations like filtering, cleaning, transforming, and analyzing data. Pandas is widely used in data science, machine learning, and other fields.

# Why Use Pandas?

Pandas offers several benefits that make it a preferred choice for data manipulation and analysis:



1. **Data Structures:** Pandas introduces two key data structures, Series (1-dimensional labeled array) and DataFrame (2-dimensional labeled data structure), which are flexible and powerful for handling data.

2. **Ease of Data Handling:** It simplifies common data manipulation tasks like indexing, filtering, reshaping, aggregating, and cleaning data, making it efficient and straightforward.

3. **Integration with Other Libraries:** Pandas integrates well with other Python libraries used in data science, such as NumPy, Matplotlib, and scikit-learn, allowing seamless data transformation and analysis within these environments.

4. **Handling Missing Data:** Pandas provides functionalities to handle missing or incomplete data, making it easier to clean and preprocess datasets without compromising the analysis.

5. **Input/Output Tools:** Pandas supports reading and writing data from various file formats like CSV, Excel, SQL databases, JSON, and more, making it easy to work with different data sources.

6. **Performance:** While there might be trade-offs between speed and convenience, Pandas is generally optimized for performance when working with medium-sized datasets. For larger datasets, developers often combine Pandas with other libraries like Dask for distributed computing.

# What Can Pandas Do?

* Data Loading
* Data Exploration
* Data Cleaning
* Data Manipulation
* Feature Enginnering
* Data Preprocessing
* Integration with ML Libraries

## Installation of Pandas
Make sure that Python is already installed.

Install it using command line: `pip install pandas`

Install in notebook: `!pip install pandas`

## Import Pandas
Once Pandas is installed, import it in your applications by adding the `import` keyword: `import pandas`

In [1]:
import pandas as pd

## Pandas Series

In Pandas, a Series is a one-dimensional labeled array capable of holding data of any type (integer, float, string, Python objects, etc.). It's similar to a Python list or a one-dimensional NumPy array but provides additional features.

In [2]:
# Creating a Series from a list
data = [10,20,30,40,50]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
type(series)

pandas.core.series.Series

In [4]:
# Custom Indexing in Series
custom_index = ['A', 'B', 'C', 'D', 'E']
series_with_custom_index = pd.Series(data, index=custom_index)
series_with_custom_index

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [5]:
print(series_with_custom_index['B']) # Accessing the item with index 'B'

20

## Pandas DataFrames

Pandas DataFrames are two-dimensional, size-mutable, and potentially heterogeneous tabular data structures with labeled axes (rows and columns). They resemble a spreadsheet or SQL table, and they consist of rows and columns, where each column can hold different types of data.

In [6]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [7]:
# Apply custom index on df
custom_index = ['ID1', "ID2", "ID3"]
df_with_custom_index = pd.DataFrame(data, index=custom_index)
df_with_custom_index

        Name  Age   City
ID1    Alice   12     NY
ID2      Bob   23     UK
ID3  Ihsanul   13  Dhaka

## Data Selection and Indexing

### Column selection

In [8]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [9]:
# Selecting specific columns by name
df[['Name']]

      Name
0    Alice
1      Bob
2  Ihsanul

In [10]:
df[['Name','Age']]

      Name  Age
0    Alice   12
1      Bob   23
2  Ihsanul   13

### iloc and loc

In [11]:
row_2 = df.iloc[2]
row_2

Name    Ihsanul
Age          13
City      Dhaka
Name: 2, dtype: object

In [12]:
# selecting rows using iloc[]
selected_rows = df.iloc[1:3] # (integer-based indexing)
selected_rows

      Name  Age   City
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [13]:
# Selecting rows using loc[] (label-based indexing)
# Apply custom index on df
custom_index = ['ID1', "ID2", "ID3"]
df_with_custom_index = pd.DataFrame(data, index=custom_index)
df_with_custom_index

        Name  Age   City
ID1    Alice   12     NY
ID2      Bob   23     UK
ID3  Ihsanul   13  Dhaka

In [14]:
df_with_custom_index.loc['ID2':'ID3']

        Name  Age   City
ID2      Bob   23     UK
ID3  Ihsanul   13  Dhaka

### query
The .query() method allows you to filter rows based on a query expression

In [15]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [16]:
# Filtering rows using query expression
filtered = df.query('Age>20')
filtered

  Name  Age City
1  Bob   23   UK

## Data Exploration and Information

### info()

The df.info() method in Pandas provides a concise summary of a DataFrame, including the index dtype and column dtypes, non-null values, and memory usage. It's a handy way to quickly get an overview of the DataFrame's structure and the data it contains.

In [17]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

### describe()
The describe() method in Pandas generates descriptive statistics that summarize the central tendency, dispersion, and shape of a dataset's distribution. It provides statistical information about numerical columns in a DataFrame.

In [19]:
df.describe()

             Age
count   3.000000
mean   16.000000
std     6.082763
min    12.000000
25%    12.500000
50%    13.000000
75%    18.000000
max    23.000000

### head() and tail()
The head() and tail() methods in Pandas are used to view a small portion of a DataFrame. They are helpful for quickly examining the beginning or end of a DataFrame to get a sense of its structure or contents.

In [20]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul',"Hasan", "Mahadi", "Sami", "Sadi", "Siam"],
    'Age' : [12,23,13,12,2,13,4,5],
    'City' : ["NY", "UK", "Dhaka","NY", "UK", "Dhaka","NY", "UK"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka
3    Hasan   12     NY
4   Mahadi    2     UK
5     Sami   13  Dhaka
6     Sadi    4     NY
7     Siam    5     UK

In [21]:
df.head()

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka
3    Hasan   12     NY
4   Mahadi    2     UK

In [22]:
df.head(6)

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka
3    Hasan   12     NY
4   Mahadi    2     UK
5     Sami   13  Dhaka

In [23]:
df.tail()

     Name  Age   City
3   Hasan   12     NY
4  Mahadi    2     UK
5    Sami   13  Dhaka
6    Sadi    4     NY
7    Siam    5     UK

In [24]:
df.tail(3)

   Name  Age   City
5  Sami   13  Dhaka
6  Sadi    4     NY
7  Siam    5     UK

### value_counts()
The value_counts() method in Pandas is used to count the occurrences of unique values in a column of a DataFrame. It's particularly useful for understanding the distribution of values within a specific column.

In [25]:
df['City'].value_counts()

NY       3
UK       3
Dhaka    2
Name: City, dtype: int64

In [26]:
df['Age'].value_counts()

12    2
13    2
23    1
2     1
4     1
5     1
Name: Age, dtype: int64

## Data Cleaning and Handling

### drop()
Drop specified rows or columns.

In [27]:
import pandas as pd

# Creating a sample dataframe
data = {
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [7,8,9]
}

df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [28]:
# Dropping a column 'C' by specifying asix = 1
df_dropped_col = df.drop('C', axis=1)
df_dropped_col

   A  B
0  1  4
1  2  5
2  3  6

In [29]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [32]:
# Inplace
df.drop('B',axis=1,inplace=True)

In [33]:
df

   A  C
0  1  7
1  2  8
2  3  9

In [34]:
df.drop([0,2])

   A  C
1  2  8

### fillna()
Fill missing values in the DataFrame.

In [35]:
df_with_null = pd.DataFrame({'A':[1,2,None, 4],
                            'B' : [5,None,7,8]})

df_with_null

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  8.0

In [36]:
# Filling mission values with a specific value
df_filled = df_with_null.fillna(0)

In [37]:
df_filled

     A    B
0  1.0  5.0
1  2.0  0.0
2  0.0  7.0
3  4.0  8.0

### drop_duplicates()
Remove duplicate rows.

In [38]:
data_duplicates = {
    'A' : [1,2,1,2,3],
    'B' : ['x','y','x','y','z']
}

df = pd.DataFrame(data_duplicates)
df

   A  B
0  1  x
1  2  y
2  1  x
3  2  y
4  3  z

In [39]:
df.drop_duplicates(inplace=True)

In [40]:
df

   A  B
0  1  x
1  2  y
4  3  z

### replace()
Replace values in the DataFrame.

In [41]:
data = {
    'A' : [1,2,3,4],
    'B' : ['X','Y','Z','X']
}

df = pd.DataFrame(data)
df

   A  B
0  1  X
1  2  Y
2  3  Z
3  4  X

In [44]:
# Replace values
df.replace({'X':'NEWX', 3:300},inplace=True)

In [45]:
df

     A     B
0    1  NEWX
1    2     Y
2  300     Z
3    4  NEWX

## Data Aggregation and Grouping

### groupby()
Group data based on specified columns.

In [51]:
import pandas as pd

data = {
    'Cat' : ['A','B','A','B','A'],
    'Value': [10,20,15,25,30]
}
df = pd.DataFrame(data)
df

  Cat  Value
0   A     10
1   B     20
2   A     15
3   B     25
4   A     30

In [53]:
grouped = df.groupby('Cat')

In [54]:
for name, group in grouped:
    print(name)
    print(group)

A
  Cat  Value
0   A     10
2   A     15
4   A     30
B
  Cat  Value
1   B     20
3   B     25

### agg()
Apply aggregation functions (sum, mean, etc.) on grouped data.

In [55]:
aggregated = grouped.agg({'Value': ['sum', 'mean']})
aggregated

    Value
      sum       mean
Cat
A      55  18.333333
B      45  22.500000

## Data Transformation

### pivot_table()

In [59]:
import pandas as pd

data = {
    'Date' : ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    'Name' : ['A','B','A','B'],
    'Price': [10,20,15,25]
}
df = pd.DataFrame(data)
df

         Date Name  Price
0  2022-01-01    A     10
1  2022-01-01    B     20
2  2022-01-02    A     15
3  2022-01-02    B     25

In [61]:
# Creating a pivot table to summarize data
pivot = df.pivot_table(values='Price', index='Date', columns='Name', aggfunc='sum')
pivot

Name         A   B
Date
2022-01-01  10  20
2022-01-02  15  25

### astype()

In [67]:
data = {
    "Num" : [1,2,3]
}

df = pd.DataFrame(data)
df

   Num
0    1
1    2
2    3

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      int64
dtypes: int64(1)
memory usage: 152.0 bytes

In [69]:
# Convert int to string
df['Num'] = df['Num'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [70]:
# Convert obj/str to num
df['Num'] = df['Num'].astype(float)
df.dtypes

Num    float64
dtype: object

## Read/Write CSV/Excel files

### Reading CSV File

In [71]:
import pandas as pd

df = pd.read_csv('healthcare-dataset-stroke-data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5110 entries, 0 to 5109
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5110 non-null   int64
 1   gender             5110 non-null   object
 2   age                5110 non-null   float64
 3   hypertension       5110 non-null   int64
 4   heart_disease      5110 non-null   int64
 5   ever_married       5110 non-null   object
 6   work_type          5110 non-null   object
 7   Residence_type     5110 non-null   object
 8   avg_glucose_level  5110 non-null   float64
 9   bmi                4909 non-null   float64
 10  smoking_status     5110 non-null   object
 11  stroke             5110 non-null   int64
dtypes: float64(3), int64(4), object(5)
memory usage: 479.2+ KB

In [72]:
df.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

### Writing CSV File

In [73]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [75]:
# Writing the df to a csv file
df.to_csv('output.csv',index=False)

### Reading Excel File

In [76]:
# Reading a excel file into df
df = pd.read_excel('students.xlsx', sheet_name='Sheet1')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      3 non-null      int64
 1   name    3 non-null      object
 2   dept    3 non-null      object
 3   cgpa    3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes

In [77]:
df.head()

    Id        name dept  cgpa
0  111     Jon Doe  ECE  3.90
1  121    Jon Snow  BBA  3.33
2  232  Alice Cuba  ECO  3.55

### Writing Excel File

In [78]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [79]:
df.to_excel('output.xlsx', sheet_name='Sheet1')

# Suggested Readings
`Pandas official documentation` https://pandas.pydata.org/docs/getting_started/index.html#getting-started

# Thank you
Â© [Dataque Academy](https://www.facebook.com/dataque.academy)